# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-01-07 11:25:06 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TAGS: web(w)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Snoopy [0/2]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  Snoopy is a naive desktop search engine for your files. It aims to be gentle
  on resource usage, index both file names, types, and metadata/content where
  feasible.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2025-01-07 Di 11:25]
   | Headline               | Time      |           |       |      |
   |------------------------+-----------+-----------+-------+------|
   | *Total time*           | *1d 7:52* |           |       |      |
   |------------------------+-----------+-----------+-------+------|
   | *Snoopy [0/2]*         | *1d 7:52* |           |       |      |
   | \_  /Components [0/2]/ |           | /1d 7:52/ |       |      |
   | \_    Data model [0/0] |           |           |  0:37 |      |
   | \_    Database [1/2]   |           |           |  5:02 |      |
   | \_      Relative paths |           |           |       | 2:09 |
   | \_    Blacklist [0/0]  |           |           |  2:51 |      |
   | \_    Walker [0/0]     |           |           |  8:42 |      |
   | \_    UI [0/0]         |           |           | 14:40 |      |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/2]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Data model [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-12-22 So 15:33]--[2024-12-22 So 16:10] =>  0:37
    :END:
*** Database [1/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-12-27 Fr 17:40]--[2024-12-27 Fr 18:13] =>  0:33
    CLOCK: [2024-12-27 Fr 17:02]--[2024-12-27 Fr 17:28] =>  0:26
    CLOCK: [2024-12-25 Mi 17:26]--[2024-12-25 Mi 18:09] =>  0:43
    CLOCK: [2024-12-23 Mo 20:31]--[2024-12-23 Mo 21:42] =>  1:11
    :END:
    I'm gonna use SQLite, it's just too obvious a choice.
**** TODO Global connection pool
     It's just the logical conclusion
**** CANCELLED Relative paths
     CLOSED: [2024-12-30 Mo 20:22]
     :LOGBOOK:
     CLOCK: [2024-12-30 Mo 18:13]--[2024-12-30 Mo 20:22] =>  2:09
     :END:
     I am not sure if this has enough impact to matter, but I could save some
     disk space if I stored the paths of Files only relative to their root
     directories.
     [2024-12-30 Mo 20:38]
     It is more trouble than it's worth.
*** Blacklist [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-07 Di 11:06]--[2025-01-07 Di 11:25] =>  0:19
    CLOCK: [2025-01-06 Mo 18:03]--[2025-01-06 Mo 19:00] =>  0:57
    CLOCK: [2024-12-27 Fr 19:15]--[2024-12-27 Fr 19:19] =>  0:04
    CLOCK: [2024-12-23 Mo 18:55]--[2024-12-23 Mo 19:56] =>  1:01
    CLOCK: [2024-12-22 So 16:10]--[2024-12-22 So 16:40] =>  0:30
    :END:
*** Walker [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-06 Mo 16:51]--[2025-01-06 Mo 17:41] =>  0:50
    CLOCK: [2024-12-28 Sa 14:44]--[2024-12-28 Sa 18:50] =>  4:06
    CLOCK: [2024-12-27 Fr 19:21]--[2024-12-27 Fr 22:42] =>  3:21
    CLOCK: [2024-12-23 Mo 20:05]--[2024-12-23 Mo 20:30] =>  0:25
    :END:
*** Extractor [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    The extractor attempts to get as much usable metadata and/or file content
    to index as possible.
*** UI [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-04 Sa 14:46]--[2025-01-04 Sa 17:34] =>  2:48
    CLOCK: [2025-01-04 Sa 14:07]--[2025-01-04 Sa 14:46] =>  0:39
    CLOCK: [2025-01-03 Fr 18:40]--[2025-01-03 Fr 23:03] =>  4:23
    CLOCK: [2025-01-02 Do 18:49]--[2025-01-02 Do 22:42] =>  3:53
    CLOCK: [2024-12-31 Di 17:41]--[2024-12-31 Di 20:04] =>  2:23
    CLOCK: [2024-12-30 Mo 20:56]--[2024-12-30 Mo 21:30] =>  0:34
    :END:
    I think I am going to have two panels (notebooks), one for the Roots and
    the respective files, and the second one for searching.
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
